export const API = [
  {
    year: 2024,
    id: 1,
    quants: [
      {
        id: 3,
        quant: 3,
        themes: [
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            data: '2024-08-10',
            mark: 17,
            id: 1,
            theme: 'Банк фаолиятида ахборотни муҳофаза қилиш хизмати',
            question: [
              {
                textarea: false,
                id: 1.1,
                option: ['Ташкил этилган ', 'Ташкил этилмаган '],
                comments: '',
                HasAttaching: false,
                question: 'Банкда ахборот хавфсизлиги хизмати ташкил этилганми?',
                innerQuestion: [
                  {
                    textarea: false,
                    id: 1,
                    comments: '',
                    option: [
                      'Ҳа (Тасдиқланган низоми, лавозим йўриқномаси ва бошқа ҳужжатларни тизимга бириктириш лозим (бириктириш))',
                      'Йўқ'
                    ],
                    HasAttaching: true,
                    question:
                      'Банк томонидан ахборот хавфсизлиги хизмати фаолиятини тасдиқловчи норматив-ҳужжатлар ишлаб чиқилганми?',

                    innerQuestion: []
                  },
                  {
                    textarea: false,
                    id: 2,
                    comments: '',
                    option: ['Масъул ходим тайинланган ', 'Буйруқ билан бириктирилга'],
                    HasAttaching: false,
                    question:
                      'Агар банкда ахборот хавфсизлиги хизмати мавжуд бўлмаса, ушбу йўналишда масъул ходим тайинланганми ёки буйруқ билан маълум бир ходимга бириктирилганми?',

                    innerQuestion: [
                      {
                        textarea: false,
                        comments: '',
                        option: [],
                        id: 1,
                        HasAttaching: true,
                        question:
                          'Масъул ходимнинг лавозим йўриқномаси ҳамда тайинланганлиги тўғрисидаги тасдиқловчи хужжат мавжудми?'
                      },
                      {
                        textarea: false,
                        comments: '',
                        id: 2,
                        option: [],
                        HasAttaching: true,
                        question:
                          'Маълум бир ҳодимга буйруқ билан бириктирилганлигини тасдиқловчи ҳужжат ҳамда унинг лавозим йўриқномасини мавжудлиги.'
                      }
                    ]
                  }
                ]
              },
              {
                textarea: false,
                id: 1.2,
                option: ['Ишлаб чиқилган', 'Ишлаб чиқилмаган'],
                HasAttaching: false,
                question: 'Ахборот хавфсизлиги сиёсати ишлаб чиқилганми?',
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2013 йил 14 июндаги “Ўзбекистон Республикасида ахборотлаштириш объектларини аттестациядан ўтказиш тизимини янада такомиллаштиришга доир қўшимча чора-тадбирлар тўғрисида”ги 170-сонли қарорига ҳамда 2013-2020 йилларда Ўзбекистон Республикаси Миллий ахборот-коммуникация тизимини ривожлантиришни мувофиқлаштириш бўйича Республика Комиссиясининг 2016 йил 23 фералдаги 7-сонли баённомасининг 10 иловасида тасдиқланган “Ўзбекистон Республикаси ҳудудида ахборот хавфсизлиги сиёсати ишлаб чиқиш бўйича методик Қўлланмаси”га асосан',
                innerQuestion: [
                  {
                    textarea: false,
                    id: 1,
                    option: ['Келишилган', 'Келишилмаган'],
                    HasAttaching: false,
                    comments: '',
                    question: 'Ахборот хавфсизлиги сиёсати мутасадди органлар билан келишилганми?',
                    innerQuestion: [
                      {
                        id: 1,
                        textarea: false,
                        comments: '',
                        HasAttaching: true,
                        question:
                          'Ахборот хавфсизлиги сиёсати мутасадди органлар билан келишилганми?',
                        option: [
                          'Келишилган (агар келишилган бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишиш жараёнида (агар келишиш жараёнида бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишилмаган'
                        ]
                      },
                      {
                        textarea: false,
                        id: 2,
                        comments: '',
                        HasAttaching: true,
                        question: '“Киберхавфсизлик маркази” ДУК билан келишилганми?',
                        option: [
                          'Келишилган (агар келишилган бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишиш жараёнида (агар келишиш жараёнида бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишилмаган'
                        ]
                      },
                      {
                        textarea: false,
                        id: 3,
                        comments: '',
                        HasAttaching: true,
                        question:
                          'Ўзбекистон Республикаси Давлат хавфсизлик хизмати билан келишилганми?',
                        option: [
                          'Келишилган (агар келишилган бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишиш жараёнида (агар келишиш жараёнида бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишилмаган'
                        ]
                      },
                      {
                        textarea: false,
                        id: 4,
                        comments: '',
                        HasAttaching: true,
                        question: 'Банк бошқарувининг ички буйруғи билан тасдиқланганми?',
                        option: [
                          'Келишилган (агар келишилган бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишиш жараёнида (агар келишиш жараёнида бўлса, тасдиқловчи ҳужжатни бириктириш лозим)',
                          'Келишилмаган'
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                textarea: false,
                id: 1.3,
                question:
                  'Ахборот ва киберхавфсизликни таъминлаш йўналишида хизмат кўрсатувчи ходимларнинг малакасини ошириш бўйича тегишли ишлар амалга оширилганми?',
                comments:
                  'Изоҳ: Ўзбекистон Республикаси давлат стандартининг O’z Dst ISO/IEC 27001:2016, 7.2.2 бандига асосан',
                HasAttaching: true,
                option: ['Ҳа (тегишли хужжатларни бириктириш лозим)', 'Йўқ '],
                innerQuestion: []
              },
              {
                textarea: false,
                id: 1.4,
                question:
                  'Банк тизимида ахборот ва киберхавфсизликни таъминлаш бўйича йиллик чора-тадбирлар режаси ишлаб чиқилганми?',
                comments: '',
                option: [
                  'Ишлаб чиқилган (тасдиқланган чора-тадбирлар режасини бириктириш лозим)',
                  'Ишлаб чиқилмаган '
                ],
                HasAttaching: true,
                innerQuestion: []
              },
              {
                textarea: false,
                id: 1.5,
                question:
                  'Банкнинг расмий веб-сайти ахборот ва киберхавфсизлик талабларига мувофиқлиги юзасидан экспертизадан ўтказилганганми?',
                comments: '',
                HasAttaching: true,
                option: ['Ҳа (экспертиза натижалари бўйича хулосани бириктириш лозим) ', 'Йўқ'],
                innerQuestion: []
              },
              {
                textarea: false,
                id: 1.6,
                question:
                  'Ўзбекистон Республикаси давлат стандартининг O’z Dst ISO/IEC 27001:2016, 9.2 бандига асосан режалаштирилган вақт оралиғида ахборот хавфсизлиги ички аудитини ўтказиш ишлари амалга оширилганми?',
                option: [
                  'Амалга оширилган (ички аудит натижалари бўйича хулосани бириктириш лозим)',
                  'Амалга оширилмаган '
                ],
                comments: '',
                HasAttaching: true,
                innerQuestion: []
              }
            ]
          },
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            data: '2024-08-10',
            mark: 17,
            id: 2,
            theme: 'Тармоқ хавфсизлиги',
            question: [
              {
                textarea: false,
                id: 2.1,
                option: [
                  'Келишилган (келишилган корпоратив тармоқ чисмасини бириктириш лозим)',
                  'Келишилмаган'
                ],
                comments: '',
                HasAttaching: true,
                textarea: false,
                question: 'Банкда ахборот хавфсизлиги хизмати ташкил этилганми?',
                innerQuestion: []
              },
              {
                id: 2.2,
                option: ['Ҳа (кўрилган чоралар бўйича маълумотларни тақдим этиш лозим)', 'Йўқ'],
                question:
                  'Тармоқ орқали ахборот алмашинуви жараёнида ҳамда фойдаланувчиларни тизимга киришида электрон баённомалар (логирование) юритилиши ташкил этилганми? (SIEM, syslog ва бошқа тизимлар)',
                innerQuestion: [],
                comments: '',
                textarea: false,
                HasAttaching: true
              },
              {
                id: 2.3,
                textarea: true,
                innerQuestion: [],
                option: [],
                HasAttaching: true,
                comments: 'Амалга оширилган ишлар тўғрисида маълумот бериш лозим',
                question:
                  'Банк томонидан тармоқ хавфсизлигини таъминлаш мақсадида қандай ишлар амалга оширилган?'
              },
              {
                id: 2.4,
                option: [
                  'Мавжуд (фойдаланилаётган мониторинг тизими ҳақида тегишли маълумотларни тақдим этиш)',
                  'Мавжуд эмас '
                ],
                textarea: false,
                HasAttaching: true,
                comments: 'Амалга оширилган ишлар тўғрисида маълумот бериш лозим',
                question:
                  'Банкда ахборот тизимлари, ресурслари, веб-сервислар, Автоматлаштирилган банк тизими, мавжуд серверлари ҳамда ахборот хавфсизлиги ва киберхавфсизликни таъминловчи аппарат-дастурий ва дастурий воситаларни мониторинг қилиш тизими мавжудми?',
                innerQuestion: [
                  {
                    textarea: true,
                    id: 1,
                    comments: '',
                    option: [],
                    HasAttaching: false,
                    question:
                      'Банк томонидан ишчи компьютерлар ва сервер воситаларини лицензияга эга операцион тизимлар билан таъминлаш ҳамда уларни расмий манбалардан ўз вақтида янгилаб бориш йўлга қўйилганми?'
                  }
                ]
              },
              {
                id: 2.5,
                question:
                  'Банкнинг локал тармоғига қўшимча маълумот ташувчи ташқи қурилмалар (флешка, диск ва ҳ.қ)ни улашга чекловлар ўрнатилганми?',
                comments: 'Амалга оширилган ишлар тўғрисида маълумотларни тақдим этиш',
                option: [],
                innerQuestion: [],
                HasAttaching: false,
                textarea: true
              },
              {
                id: 2.6,
                question:
                  'Банк томонидан тармоқлараро экран созланишлари тегишли тартибда тасдиқланганми?',
                option: ['Тасдиқланган (тасдиқланган хужжатнибириктириш лозим)', 'Тасдиқланмаган'],
                innerQuestion: [],
                HasAttaching: true,
                textarea: false,
                comments: ''
              },
              {
                id: 2.7,
                question:
                  'Тажовусларни аниқлаш ва уларни олдини олиш тизими IPS/IDS жорий этилганми? ',
                option: ['Жорий этилган (тегишли маълумотларни тақдим этиш)', 'Жорий этилмаган '],
                innerQuestion: [],
                HasAttaching: true,
                textarea: false,
                comments: ''
              },
              {
                id: 2.8,
                question:
                  'Маълумотларни рухсатсиз тарқалишини олдини олиш ва назорат қилиш (DLP) тизими жорий этилганми? ',
                option: ['Жорий этилган (тегишли маълумотларни тақдим этиш)', 'Жорий этилмаган '],
                innerQuestion: [],
                HasAttaching: true,
                textarea: false,
                comments: ''
              },
              {
                id: 2.9,
                question:
                  'Корпоратив тармоқда илова серверлари билан фойдаланувчиларнинг ўзаро ахборот алмашинувида ҳимояланган протоколдан қўлланилладими?',
                option: ['Қўлланилади', 'Қўлланилмайди'],
                innerQuestion: [],
                HasAttaching: true,
                textarea: false,
                comments: ''
              },
              {
                id: 2.1,
                question:
                  'Маълумотларни рухсатсиз тарқалишини олдини олиш ва назорат қилиш (DLP) тизими жорий этилганми? ',
                option: [],
                innerQuestion: [],
                HasAttaching: false,
                textarea: true,
                comments: 'Кўрилган чоралар бўйича маълумотларни тақдим этиш лозим'
              }
            ]
          },
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            data: '2024-08-10',
            mark: '17',
            id: 3,
            theme: 'Электрон почта ва интернет тармоғидан фойдаланиш',
            question: [
              {
                id: 3.1,
                textarea: false,
                option: [
                  'Жорий этилган  (электрон почта тури ва номи ишлатиш тартиби бўйича тартиб ёки йўриқнома ишлаб чиқилганлиги)',
                  'Жорий этилмаган '
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Банкда ички электрон почта ва тезкор маълумотларни алшашиш (messenger) тизими жорий этилганми?',
                innerQuestion: []
              },
              {
                id: 3.2,
                textarea: false,
                option: [],
                comments: 'Амалга оширилган ишлар бўйича маълумотларни тақдим этиш лозим',
                HasAttaching: false,
                question:
                  'Электрон почта орқали қабул қилинган маълумотлар тизимга зарар келтирмаслиги учун қандай ишлар амалга оширилган?',
                innerQuestion: []
              },
              {
                id: 3.3,
                textarea: false,
                option: [
                  'Жорий этилган (қайси дастурий ёки виртуал воситалар билан ажратилган, номи)',
                  'Жорий этилмаган'
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Банкда ички электрон почта ва тезкор маълумотларни алшашиш (messenger) тизими жорий этилганми?',
                innerQuestion: []
              },
              {
                id: 3.4,
                textarea: false,
                option: [
                  'Жорий этилган (амалга оширилган ишлар тўғрисида маълумот бериш лозим)',
                  'Жорий этилмаган'
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Банк тегишли серверларини демилитаризация қилинган зоналарда (DMZ) жойлаштириш жорий этилганми?',
                innerQuestion: []
              },
              {
                id: 3.5,
                textarea: false,
                option: [
                  'Жорий этилган (амалга оширилган ишлар тўғрисида маълумот бериш лозим)',
                  'Жорий этилмаган'
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Мижозлар учун ташкил этилган Wi-Fi зоналари банк локал тармоғидан жисмонан ажратилганми?',
                innerQuestion: []
              }
            ]
          },
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            data: '2024-08-10',
            mark: 4,
            theme: 'Маълумотларни рухсатсиз тарқалишидан ҳимоялаш тизими ва антивирус муҳофазаси',
            id: 4,
            question: [
              {
                id: 4.1,
                textarea: false,
                option: ['Мавжуд', 'Мавжуд эмас '],
                comments: '',
                HasAttaching: false,
                question: 'Банкда ахборот хавфсизлиги хизмати ташкил этилганми?',
                innerQuestion: [
                  {
                    id: 1,
                    textarea: false,
                    comments: '',
                    option: ['Ҳа ', 'Йўқ'],
                    HasAttaching: false,
                    question: 'Антивирус дастурининг лицензияси актуал ҳолатдами?',
                    innerQuestion: []
                  },
                  {
                    id: 2,
                    textarea: false,
                    comments: '',
                    option: ['Ҳа ', 'Йўқ'],
                    HasAttaching: false,
                    question: 'Антивирус дастурининг базалари автив ҳолатдами?',
                    innerQuestion: []
                  }
                ]
              }
            ]
          },
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            id: 5,
            data: '2024-08-10',
            mark: 16,
            theme: 'Электрон рақамли имзо ва шифрлаш калитларидан фойдаланиш',
            question: [
              {
                id: 5.1,
                textarea: false,
                option: [
                  'Ташкил этилган (марказ ташкил этилганилиги тўғрисидаги хужжатни бириктириш)',
                  'Ташкил этилмаган '
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Банкда электрон рақамли имзони калитларини рўйхатга олиш маркази ташкил этилганми?',
                innerQuestion: []
              },
              {
                id: 5.2,
                textarea: false,
                option: ['Мавжуд ишлаб (ишлаб чиқилган хужжатни бириктириш)', 'Мавжуд эмас'],
                comments: '',
                HasAttaching: true,
                question:
                  'Электрон рақамли имзо ва шифрлаш калитларини ишлатиш бўйича тартиб ёки йўриқнома ишлаб мавжудми?',
                innerQuestion: []
              },
              {
                id: 5.3,
                textarea: false,
                option: [
                  'Мавжуд ишлаб (тартиб тўғрисидаги маълумотлари бириктириш лозим)',
                  'Ишлаб чиқилмаган '
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Электрон рақамли имзо ва шифрлаш калитларини ишлатиш бўйича тартиб ёки йўриқнома ишлаб мавжудми?',
                innerQuestion: []
              },
              {
                id: 5.4,
                textarea: true,
                option: [],
                comments: 'Амалга оширилган ишлар тўғрисидаги маълумотларни тақдим этиш лозим',
                HasAttaching: false,
                question:
                  'Банкда фойдаланувчиларнинг ЭРИ очиқ калитларини рўйхатга олиш ва ҳисобини юритиш бўйича қандай ишлар амалга оширилган?',
                innerQuestion: []
              },
              {
                id: 5.5,
                textarea: false,
                option: [
                  'Назоратга олинган (амалга оширилган ишлар тўғрисида маълумот бериш лозим)',
                  'Назоратга олинмаган '
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Электрон рақамли имзо калитларининг амал қилиш муддати назоратга олинганми?',
                innerQuestion: []
              },
              {
                id: 5.6,
                textarea: false,
                option: ['Ишлаб чиқилган (хужжат нусҳасини бириктириш лозим)', 'Ишлаб чиқилмаган '],
                comments: '',
                HasAttaching: true,
                question:
                  'Банк ва ташқи ташкилотлар ўртасида ўзаро маълумот алмашиш жараёнида ЭРИ ва шифрлаш калитларини қўллаш бўйича норматив-хужжат ишлаб чиқилганми?',
                innerQuestion: []
              },
              {
                id: 5.7,
                textarea: false,
                option: [
                  'Назоратга олинган (амалга оширилган ишлар тўғрисида маълумот бериш лозим)',
                  'Назоратга олинмаган '
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Электрон рақамли имзо калитларидан фойдаланиш тартиби назоратга олинганми?',
                innerQuestion: []
              },
              {
                id: 5.8,
                textarea: false,
                option: ['Ҳа (тегишли хужжатларни бириктириш лозим)', 'Йўқ'],
                comments: '',
                HasAttaching: true,
                question:
                  'Банкда қўлланилаётган электрон рақамли имзо калитлари сертификатлари тўғрисидаги маълумотлар шакллантирилганми?',
                innerQuestion: [
                  {
                    id: 1,
                    question:
                      'O’zDST алгоритми асосида ҳисобот даврида генерация қилинган ЭРИ калит сертификатлар сони?',
                    comments:
                      '1)	Йил бошидан жами сони: ______; ундан вилоятлар кесимида: ______; 2)	Ҳисобот даврида генерация қилинганлар сони: ',
                    textarea: true,
                    HasAttaching: false,
                    option: [],
                    innerQuestion: [
                      {
                        id: 1.2,
                        question:
                          'RSA алгоритми асосида ҳисобот даврида генерация қилинган ЭРИ калит сертификатлар сони?',
                        comments:
                          '1)	Йил бошидан жами сони: ______; ундан вилоятлар кесимида: ______; 2)	Ҳисобот даврида генерация қилинганлар сони: ______; ундан вилоятлар кесимида: ______;',
                        option: [],
                        textarea: true,
                        HasAttaching: false
                      },
                      {
                        id: 1.3,
                        question:
                          'GOST алгоритми асосида ҳисобот даврида генерация қилинган ЭРИ калит сертификатлар сони?',
                        comments:
                          '1)	Йил бошидан жами сони: ______; ундан вилоятлар кесимида: ______; 2)	Ҳисобот даврида генерация қилинганлар сони: ______; ундан вилоятлар кесимида: ______;',
                        option: [],
                        textarea: true,
                        HasAttaching: false
                      }
                    ]
                  }
                ]
              },
              {
                id: 5.9,
                textarea: true,
                option: [],
                comments: 'ЭРИ билан ҳимояланган тизимлар тўғрисида маълумот киритиш лозим',
                HasAttaching: false,
                question: 'Банкнинг нечта ахборот тизимлари ЭРИ калитлари билан ҳимояланган',
                innerQuestion: []
              }
            ]
          },
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            data: '2024-08-10',
            mark: 8,
            theme: 'Электрон архивни ташкил қилиш, электрон архив ҳужжатларининг таркиби',
            id: 6,
            question: [
              {
                id: 6.1,
                textarea: true,
                option: [],
                comments: 'Амалга оширилган ишлар тўғрисида маълумот бериш лозим',
                HasAttaching: false,
                question:
                  'Банк тизимида электрон архивни юритиш бўйича қандай ишлар амалга оширилган?',
                innerQuestion: []
              },
              {
                id: 6.2,
                textarea: false,
                option: [
                  'Ишлаб чиқилган (Архивда сақланувчи тасдиқланган маълумотлар тўғрисидаги хужжатни бириктириш)',
                  'Ишлаб чиқилмаган '
                ],
                comments: '',
                HasAttaching: true,
                question: 'Электрон архивда сақланувчи маълумотлар рўйхати ишлаб чиқилганми?',
                innerQuestion: []
              },
              {
                id: 6.3,
                textarea: true,
                option: [],
                comments: 'Амалга оширилган ишлар тўғрисида маълумот бериш',
                HasAttaching: false,
                question:
                  'Электрон архив нусҳалари камида 2 та жойда сақланиши бўйича қандай ишлар амалга оширилган?',
                innerQuestion: []
              },
              {
                id: 6.4,
                textarea: false,
                option: ['Мавжуд (хужжатни бириктириш лозим)', 'Мавжуд эмас '],
                comments: '',
                HasAttaching: true,
                question:
                  'Электрон архив нусҳаларини ташқи сақловчиларга кўчириш бўйича ички тартиб мавжудми? ',
                innerQuestion: []
              }
            ]
          },
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            data: '2024-08-10',
            mark: 10,
            theme:
              'Автоматлаштирилган банк тизими иш жараёнининг узлуксизлигини ва қайта тиклашни таъминлаш',
            id: 7,
            question: [
              {
                id: 7.1,
                textarea: true,
                option: [],
                comments: 'Амалга оширилган ишлар тўғрисида маълумот бериш',
                HasAttaching: false,
                question:
                  'АБТларни фавқулотда (ёнғин, зилзила, сув тошқини ва бошқа) ҳолатлардан ҳимоя қилиш қандай ишлар амалга оширилган?',
                innerQuestion: []
              },
              {
                id: 7.2,
                textarea: false,
                option: [
                  'Ҳа (захира маркази ташкил этилганлиги тўғрисидаги хужжатни бириктириш )',
                  'Йўқ '
                ],
                comments: '',
                HasAttaching: true,
                question: 'Захира маркази ташкил этилганми?',
                innerQuestion: []
              },
              {
                id: 7.3,
                textarea: false,
                option: ['Ҳа (ишлаб чиқилган хужжатни бириктириш лозим)', 'Йўқ '],
                comments: '',
                HasAttaching: true,
                question: 'Захира тикланиш режаси ишлаб чиқилиб тегишли тартибда тасдиқланганми?',
                innerQuestion: []
              },
              {
                id: 7.4,
                textarea: false,
                option: [
                  'Ишлаб чиқилган (ишлаб чиқилган ва  тасдиқланган хужжатни бириктириш лозим)',
                  'Ишлаб чиқилмаган '
                ],
                comments: '',
                HasAttaching: true,
                question:
                  'Банкда қайта тикланувчи маълумотлар рўйхати ишлаб чиқилиб тегишли тартибда тасдиқланганми?',
                innerQuestion: []
              },
              {
                id: 7.5,
                textarea: true,
                option: [],
                comments: 'Амалга оширилган ишлар тўғрисида маълумот бериш',
                HasAttaching: false,
                question:
                  'Захира маркази хонасининг хавфсизлигини таъминлаш бўйича қандай ишлар амалга оширилган? ',
                innerQuestion: []
              },
              {
                id: 7.6,
                textarea: false,
                option: ['Амалга оширилган ', 'Амалга оширилмаган '],
                comments: '',
                HasAttaching: false,
                question:
                  'Банкда ахборот хавфсизлиги ташкилий чораларини кўришда маълумотларни қайта ишлаш, сақлаш ва узатиш учун асосий техник ускуналарни (UPS, стабилизатор, батареялар, дизел генераторлар) ишончли ва узлуксиз электр таъминоти билан таъминлаш амалга оширилганми?',
                innerQuestion: []
              }
            ]
          },
          {
            image:
              'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQapquFaXpaIm2CSRJKchEl04G4EMDig0QDvg&s',
            data: '2024-08-10',
            mark: 10,
            theme: 'Конфиденциал маълумотларнинг ошкор этилишидан ҳимоялаш ',
            id: 8,
            question: [
              {
                id: 8.1,
                textarea: false,
                option: ['Мавжум (Тегишли хужжатни бириктириш лозим)', 'Мавжуд эмас'],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2015 йил 16 октябрдаги 295-сонли “Ўзбекистон Республикаси ахборотлаштириш объектларида конфиденциал маълумотнинг хавфсизлигини ташкил қилиш ва таъминлаш тўғрисида”ги қарорига асосан',
                HasAttaching: true,
                question:
                  'Банкда конфиденциал маълумотлар рўйхатини шакллантириш бўйича комиссия таркиби мавжудми?',
                innerQuestion: []
              },
              {
                id: 8.2,
                textarea: false,
                option: [
                  'Белгиланган (тегишли хужжатларни бириктириш талаб этилади)',
                  'Белгиланмаган'
                ],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2015 йил 16 октябрдаги 295-сонли “Ўзбекистон Республикаси ахборотлаштириш объектларида конфиденциал маълумотнинг хавфсизлигини ташкил қилиш ва таъминлаш тўғрисида”ги қарорига асосан',
                HasAttaching: true,
                question: 'Конфиденциал маълумотларнинг рўйхати ва ҳажми белгиланганми?',
                innerQuestion: []
              },
              {
                id: 8.3,
                textarea: false,
                option: [
                  'Тасдиқланган (тегишли хужжатларни бириктириш талаб этилади)',
                  'Тасдиқланмаган'
                ],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2015 йил 16 октябрдаги 295-сонли “Ўзбекистон Республикаси ахборотлаштириш объектларида конфиденциал маълумотнинг хавфсизлигини ташкил қилиш ва таъминлаш тўғрисида”ги қарорига асосан',
                HasAttaching: true,
                question:
                  'Банкда конфиденциал маълумотлар билан ишлашга рухсат берилган шахсларнинг рўйхати тасдиқланганми?',
                innerQuestion: []
              },
              {
                id: 8.4,
                textarea: false,
                option: [
                  'Ишлаб чиқилган  (тегишли хужжатларни бириктириш талаб этилади)',
                  'Ишлаб чиқилмаган '
                ],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2015 йил 16 октябрдаги 295-сонли “Ўзбекистон Республикаси ахборотлаштириш объектларида конфиденциал маълумотнинг хавфсизлигини ташкил қилиш ва таъминлаш тўғрисида”ги қарорига асосан',
                HasAttaching: true,
                question: 'Ахборотлаштириш объектининг техник паспорти ишлаб чиқилганми?',
                innerQuestion: []
              },
              {
                id: 8.5,
                textarea: false,
                option: ['Мавжуд  (тегишли хужжатларни бириктириш талаб этилади)', 'Мавжуд эмас'],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2015 йил 16 октябрдаги 295-сонли “Ўзбекистон Республикаси ахборотлаштириш объектларида конфиденциал маълумотнинг хавфсизлигини ташкил қилиш ва таъминлаш тўғрисида”ги қарорига асосан',
                HasAttaching: true,
                question:
                  'Банкда конфиденциал маълумотларни ташувчи воситаларни ҳисобга олиш журнали мавжудми:?',
                innerQuestion: []
              },
              {
                id: 8.6,
                textarea: false,
                option: ['Мавжуд  (тегишли хужжатларни бириктириш талаб этилади)', 'Мавжуд эмас'],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2015 йил 16 октябрдаги 295-сонли “Ўзбекистон Республикаси ахборотлаштириш объектларида конфиденциал маълумотнинг хавфсизлигини ташкил қилиш ва таъминлаш тўғрисида”ги қарорига асосан',
                HasAttaching: true,
                question:
                  'Банкда конфиденциал маълумотларни ташувчи воситаларни йўқ қилиш тартиби ва журналининг мавжудми?',
                innerQuestion: []
              },
              {
                id: 8.7,
                textarea: false,
                option: ['Мавжуд  (тегишли хужжатларни бириктириш талаб этилади)', 'Мавжуд эмас'],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2015 йил 16 октябрдаги 295-сонли “Ўзбекистон Республикаси ахборотлаштириш объектларида конфиденциал маълумотнинг хавфсизлигини ташкил қилиш ва таъминлаш тўғрисида”ги қарорига асосан',
                HasAttaching: true,
                question:
                  'Конфиденциал маълумотларни ташувчи воситаларни ахборотлаштириш объектидан олиб чиқиш/кириш тартиби ҳамда қайд этиш журнали мавжудми?',
                innerQuestion: []
              },
              {
                id: 8.8,
                textarea: false,
                option: [
                  'Белгиланган  (тегишли хужжатларни бириктириш талаб этилади)',
                  'Белгиланмаган'
                ],
                comments:
                  'Изоҳ: Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2006 йил 5 декабрдаги “Махфий бўлмаган, тарқатилиши чекланган маълумотларни ўз ичига олган ҳужжат, жилд ва нашрларни ҳисобга олиш, муомала қилиш ва сақлаш тўғрисида”ги Йўриқномага асосан',
                HasAttaching: true,
                question: 'Банкда ХДФУ грифли хужжатлар билан ишлаш тартиби белгиланганми?',
                innerQuestion: []
              },
              {
                id: 8.9,
                textarea: false,
                option: ['Ҳа (тегишли хужжатларни бириктириш талаб этилади)', 'Йўқ'],
                comments: '',
                HasAttaching: true,
                question:
                  'Банк ходимларидан конфиденциал маълумотларни сир сақлаши ва ошкор этишини олдини олиш бўйича мажбуриятномалар (шартнома) имзоланганми?',
                innerQuestion: []
              },
              {
                id: 8.1,
                textarea: false,
                option: ['Ҳа (амалга оширилган ишлар тўғрисида маълумот бериш лозим)', 'Йўқ'],
                comments: '',
                HasAttaching: true,
                question:
                  'Конфиденциал маълумотларни ўзида сақловчи компютерларнинг хавфсизлиги ва ишончлилиги етарли даражада таъминланганми?',
                innerQuestion: []
              },
              {
                id: 8.1,
                textarea: false,
                option: ['Ҳа (амалга оширилган ишлар тўғрисида маълумот бериш лозим)', 'Йўқ'],
                comments: '',
                HasAttaching: true,
                question:
                  'Телекоммуникация тармоғи ва ижтимоий тармоқлардаги (messenger)лар орқали конфиденциал маълумотларнинг узатилишини олдини олиш бўйича қандай ишлар амалга оширилган?',
                innerQuestion: []
              }
            ]
          }
        ]
      }
    ],
    id: 7
  }
]

const findLatestYearAndQuant = (data) => {
  // Находим самый высокий год
  const maxYear = Math.max(...data.map((item) => item.year))

  // Находим объект с самым высоким годом
  const latestYearData = data.find((item) => item.year === maxYear)

  // Находим максимальную четверть в этом году
  const maxQuant = Math.max(...latestYearData.quants.map((quant) => quant.quant))

  // Находим объект четверти, соответствующий самой высокой четверти
  const latestQuantData = latestYearData.quants.find((quant) => quant.quant === maxQuant)

  return {
    year: maxYear,
    quant: maxQuant,
    themes: latestQuantData.themes // Возвращаем данные по темам этой четверти
  }
}

export const latestYearAndQuant = findLatestYearAndQuant(API)
console.log(latestYearAndQuant)
